nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw70/demo_apps/lin_stack/slave/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitACCELPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitACCELPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    const port_pin_config_t port_c0_pin37_config = {/* Internal pull-up resistor is enabled */
                                                    .pullSelect = (uint16_t)kPORT_PullUp,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPI2C1_SCL */
                                                    .mux = (uint16_t)kPORT_MuxAlt7,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C0 (pin 37) is configured as LPI2C1_SCL */
    PORT_SetPinConfig(PORT_C, 0U, &port_c0_pin37_config);

    const port_pin_config_t port_c1_pin38_config = {/* Internal pull-up resistor is enabled */
                                                    .pullSelect = (uint16_t)kPORT_PullUp,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                    /* Pin is configured as LPI2C1_SDA */
                                                    .mux = (uint16_t)kPORT_MuxAlt7,
                                                    /* Digital input is not inverted */
                                                    .invertInput = (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_C1 (pin 38) is configured as LPI2C1_SDA */
    PORT_SetPinConfig(PORT_C, 1U, &port_c1_pin38_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLINPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '11', peripheral: LPUART_0, signal: RX, pin_signal: ADC0_A4/PTA16/LPSPI0_PCS0/EWM0_OUT_b/LPI2C0_SCLS/LPUART0_RX/RF_GPO_8/PWM0_A0, pull_select: down,
    pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '12', peripheral: LPUART_0, signal: TX, pin_signal: ADC0_A5/PTA17/LPSPI0_SIN/EWM0_IN/LPI2C0_SDAS/LPUART0_TX/RF_GPO_7/RF_GPO_8/PWM0_B0, pull_select: down,
    pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLINPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLINPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);

    const port_pin_config_t port_a16_pin11_config = {/* Internal pull-up/down resistor is disabled */
                                                     .pullSelect = (uint16_t)kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                     /* Pin is configured as LPUART0_RX */
                                                     .mux = (uint16_t)kPORT_MuxAlt6,
                                                     /* Digital input is not inverted */
                                                     .invertInput = (uint16_t)kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_A16 (pin 11) is configured as LPUART0_RX */
    PORT_SetPinConfig(PORT_A, 16U, &port_a16_pin11_config);

    const port_pin_config_t port_a17_pin12_config = {/* Internal pull-up/down resistor is disabled */
                                                     .pullSelect = (uint16_t)kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                     /* Pin is configured as LPUART0_TX */
                                                     .mux = (uint16_t)kPORT_MuxAlt6,
                                                     /* Digital input is not inverted */
                                                     .invertInput = (uint16_t)kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_A17 (pin 12) is configured as LPUART0_TX */
    PORT_SetPinConfig(PORT_A, 17U, &port_a17_pin12_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLIGHT_SENSORPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '17', peripheral: ADC_0, signal: 'A, 6', pin_signal: ADC0_A6/CMP0_IN3/PTA20/LPSPI0_PCS2/LPUART0_TX/EWM0_IN/RF_GPO_2/PWM0_A2, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

