nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw70/demo_apps/lin_stack/slave/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLIGHT_SENSORPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLIGHT_SENSORPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);

    const port_pin_config_t port_a20_pin17_config = {/* Internal pull-up/down resistor is disabled */
                                                     .pullSelect = (uint16_t)kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                     /* Pin is configured as ADC0_A6 */
                                                     .mux = (uint16_t)kPORT_PinDisabledOrAnalog,
                                                     /* Digital input is not inverted */
                                                     .invertInput = (uint16_t)kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORT_A20 (pin 17) is configured as ADC0_A6 */
    PORT_SetPinConfig(PORT_A, 20U, &port_a20_pin17_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
